[Reward_Gatekeeper X2RewardTemplate]
DisplayName="看门人单位"
RewardDetails="XCOM获得看门人"

[GatekeeperClass X2SoldierClassTemplate]
+DisplayName="看门人"
+ClassSummary="一个强大的灵能单位，与变种人的长老相当"
+LeftAbilityTreeTitle="看门人"
+RightAbilityTreeTitle="看门人"
+AbilityTreeTitles[0]="看门人"
+AbilityTreeTitles[1]="看门人"
+AbilityTreeTitles[3]="XCOM"
;ALPHABETICAL ORDER
+RandomNickNames[0]="看门人"
+RandomNickNames[1]="祖里尔"


[PA_GatekeeperGun X2WeaponTemplate]
FriendlyName="看门人冲击波"
BriefSummary="看门人冲击波"
TacticalText="<Bullet/> 看门人冲击波. <看门人/>人类士兵不能使用 -- 这是他们的一部分！"
AbilityDescName="看门人冲击波"

[PA_GatekeeperPsiAmp X2WeaponTemplate]
FriendlyName="看门人力量"
BriefSummary="看门人力量"
TacticalText="<Bullet/> 看门人从周围的环境中夺取他们的力量。<Bullet/>人类士兵不能使用 -- 这是他们的一部分！"
AbilityDescName="看门人力量"

[PA_Gatekeeper_Tech X2TechTemplate]
DisplayName="修复看门人"
Summary="我们可以利用他们巨大的灵能输出来复活外壳，在总工程师沈的帮助下，我们可以创造我们自己的看门人。"
CodeName="触手"
LongDescript="看门人修复工作取得了成功"

[XGCharacterGenerator_Gatekeeper]
JunkSparkFirstName="看门人"
JunkSparkLastNamePrefix="000"

[PA_Domination X2AbilityTemplate]
LocFriendlyName="区域控制"
LocLongDescription="永久地对一个区域内的敌人进行精神控制。只<Ability:PA_Domination_Charge_Tag/>每个任务都可以执行成功的控制攻击。"
LocHelpText="永久地对敌人进行精神控制。每个任务只能成功执行一次控制。"
LocFlyOverText="控制"
LocMissMessage="控制失败"
LocPromotionPopupText="<Bullet/>控制需要看门人灵能强度与目标意志的较量。<br/><Bullet/>如果尝试控制失败，则会出现<Ability:PA_Domination_coolDown_Tag/>在可以尝试另一个控制之前需要冷却。<br/><Bullet/>如果看门人死亡或离开战场，则控制被解除。<br/>"


[PA_AnimaGate X2AbilityTemplate]
LocFriendlyName="火焰光束"
LocLongDescription="通过打开一个微型通道并聚焦释放的能量，看门人可以在极远的距离投射破坏力。"
LocHelpText="向目标发射一束聚焦能量。"

[PA_AnimaConsume X2AbilityTemplate]
LocFriendlyName="虹吸"
LocLongDescription="看门人的触摸可能会消耗附近单位的生命，在造成严重伤害的同时自我修复。如果目标被此攻击杀死，则它可能会以灵能僵尸的形式复活。"
LocHelpText="在近战范围内吸取人形目标的生命，如果它被杀死，则将其提升为灵能僵尸。"
LocFlyOverText="虹吸"

[PA_AnimaInversion X2AbilityTemplate]
LocFriendlyName="通道"
LocLongDescription="在一个区域打开一个毁灭性的灵能裂缝。任何被杀死的人形敌人都可以作为灵能僵尸饲养。"
LocHelpText="在一个区域打开一个毁灭性的灵能裂缝。任何被杀死的人形敌人都可以作为灵能僵尸饲养。"

[PA_收回 X2AbilityTemplate]
LocFriendlyName="关闭外壳"
LocLongDescription="如果一个开阔的看门人被攻击击中并受到伤害，它将会收回它的壳中。"
LocHelpText="看门人在受伤时收回其防御外壳。"
LocFlyOverText="关闭外壳"

[PA_GatekeeperOpen X2AbilityTemplate]
LocFriendlyName="开启外壳"
LocLongDescription="打开看门人的外壳减少装甲，切换至开启状态，可使用灵能技能。"
LocHelpText="打开看门人的外壳减少装甲，切换至开启状态，可使用灵能技能。"
LocFlyOverText="开启外壳"

[PA_GatekeeperClose X2AbilityTemplate]
LocFriendlyName="关闭外壳"
LocLongDescription="关闭看门人外壳，增加护甲但阻止使用某些技能。"
LocHelpText="关闭看门人外壳，增加护甲但阻止使用某些技能。"
LocFlyOverText="关闭外壳"

[GatekeeperClosedEffect X2AbilityTemplate]
LocFriendlyName="装甲壳"
LocLongDescription="看门人外壳已关闭。它更耐损坏。"
LocHelpText="看门人在外壳关闭时获得盔甲和防御加成。"
LocFlyOverText="装甲壳"

[PA_ProtectiveShell X2AbilityTemplate]
LocFriendlyName="保护壳"
LocLongDescription="当看门人外壳闭合时，它对伤害有极强的抵抗力，但进攻选择有限。"
LocHelpText="当看门人外壳闭合时，它对伤害有极强的抵抗力，但进攻选择有限。"
LocFlyOverText="保护壳"


PA_GatekeeperClosedEffectName="关闭状态"
PA_GatekeeperClosedEffectDesc="看门人外壳已关闭。在这种状态下，它更能抵抗损坏。"
